"use strict";

const TEXT = `
Ф. ДОСТОЕВСКИЙ

ПРЕСТУПЛЕНИЕ И НАКАЗАНИЕ



РОМАН В ШЕСТИ ЧАСТЯХ С ЭПИЛОГОМ

Вступительная статья и примечания Г. Фридлендера

Иллюстрации Д. Шмаринова





«ПРЕСТУПЛЕНИЕ И НАКАЗАНИЕ» ДОСТОЕВСКОГО


1


Роман Ф. М. Достоевского «Преступление и наказание» принадлежит к числу тех великих произведений мировой литературы, ценность которых со временем не умаляется, но возрастает для каждого следующего поколения. Подобно «Божественной Комедии», «Гамлету», «Фаусту», «Войне и миру» или «Анне Карениной», «Преступление и наказание» давно сделалось во всем мире одной из самых любимых и широко читаемых книг. Образ Родиона Раскольникова стал вечным спутником человечества.

В центре «Преступления и наказания» находится тот болезненный и острый вопрос, который явился одним из главных вопросов для всей реалистической литературы XIX века. Это — вопрос о возможных путях развития человеческой личности в тех новых условиях жизни, которые сложились в Западной Европе после французской буржуазной революции XVIII века и которые после крестьянской реформы 1861 года установились также и в России. Романисты-просветители, еще не видевшие (по выражению Ленина) противоречий того строя жизни, который вырастал из крепостного,[1 - В. И. Ленин, Полное собрание сочинений, т. 2, стр. 520.] верили, что уничтожение абсолютизма и сословности сделает возможным всестороннее развитие человека. Но после победы буржуазии стало очевидным, что вера в свободное, гармоническое развитие личности в условиях общества, основанного на эгоистической «войне всех против всех», была иллюзией. Бальзак, Стендаль, Диккенс, Теккерей, Флобер и другие западноевропейские романисты блестяще показали, что буржуазное общество хотя и способствует пробуждению личности, вместе с тем является величайшим препятствием для ее развития, ведет к ее духовной и физической гибели.

Великие русские писатели XIX века, начиная с Пушкина, так же, как их современники на Западе, высоко подняли знамя борьбы за свободное развитие личности. Но Пушкин в «Цыганах», «Евгении Онегине», «Пиковой даме» отчетливо показал и то, что индивидуалистическая жизненная философия и мораль личности, «глядящей в Наполеоны», суха и бесчеловечна. Со времен великого поэта в русской литературе получили выражение две, на первый взгляд противоположные между собой, но в действительности взаимно связанные, дополняющие друг друга темы: тема защиты прав личности и тема критического анализа и развенчания принципов буржуазно-индивидуалистической философии и морали — морали человека, который «для себя лишь» хочет воли. Органическое объединение в «Преступлении и наказании» этих двух тем определяет глубокий гуманистический пафос этого романа, его неумирающее значение для настоящего и будущего.

Достоевский писал в конце своей жизни, что его заветной мечтой как человека и писателя всегда оставалось стремление помочь «девяти десятым» человечества, угнетенным и обездоленным в его эпоху в России и во всем мире, обрести достойное человека существование, завоевать путь в «царство мысли и света».[2 - Ф. М. Достоевский, Дневник писателя за 1873 и 1876 годы, ГИЗ, М.—Л. 1929, стр. 173.] Во всей реалистической прозе XIX века нет другого произведения, которое с таким бесстрашием и такою поистине шекспировскою мощью изображало картины страданий широких масс, вызванные нищетой, социальным неравенством и угнетением, как «Преступление и наказание». Но роман Достоевского — не только полное захватывающего трагизма изображение обездоленности и социального зла. Это — и апелляция к человеческой совести и разуму. Вместе со своим главным героем Достоевский гневно отвергает как оскорбительные для человека взгляды многих (в том числе ряда религиозных) мыслителей своей эпохи, которые полагали, что страдания и нищета неизбежны во всяком обществе, что они составляют извечный удел человечества. Великий русский писатель страстно защищает идею нравственного достоинства человека, который не хочет оставаться ничтожной «вошью», не желает безмолвно подчиняться и терпеть, но всем своим существом восстает против общественной несправедливости, не хочет и не может примириться с нею.


И вместе с тем Достоевский утверждает другое. Писатели-романтики начала XIX века были готовы идеализировать любой бунт человеческой личности против мира «посредственности» и «прозы». Достоевский же, живший во второй половине XIX века, в более сложной исторической обстановке, стремится подвергнуть философскому и психологическому анализу не только условия жизни внешнего мира, окружающего героя «Преступления и наказания», но и субъективные, движущие мотивы поведения последнего. Это позволяет автору «Преступления и наказания» одному из первых в мировой литературе поднять в романе широкий круг вопросов, еще не встававших столь остро перед его предшественниками. Достоевский рисует в «Преступлении и наказании» образ мыслящего, честного и бескомпромиссного с самим собой и другими людьми молодого человека, исполненного искренней боли за окружающих, горячего негодования против существующей социальной несправедливости. Но в буржуазном мире — и это уже более или менее отчетливо сознает Достоевский — существуют не только здоровые, но и больные формы личного и социального протеста. Даже вполне искренняя и бескорыстная по своим истокам пытливая мысль не всегда приводит здесь к верному пониманию конечных причин социальной несправедливости и реальных путей борьбы с нею. Из одного и того же ростка в мире социального угнетения может развиться и горячая любовь к обездоленным и угнетенным, готовность делить их горе и отстаивать их права, и одинокий, мрачный, анархический протест, направленный против общества, протест, стремящийся ниспровергнуть самые основы всякого социального общежития. Эти тревожные и во многом оказавшиеся — как показала последующая история человечества — пророческими размышления русского писателя получили отражение в «Преступлении и наказании».



2


Сердцевину «Преступления и наказания» составляет психологическая история преступления и его нравственных последствий. Но главный герой «Преступления и наказания» Родион Раскольников — необычный преступник. Свое преступление — убийство ростовщицы Алены Ивановны — он совершает под влиянием созданной и выстраданной им системы идей, рассматривая это преступление как своеобразный социально-психологический эксперимент, который должен подтвердить не только в его собственных глазах, но и в глазах остальных людей правильность его теоретических выводов. Поэтому психологический анализ состояния преступника до и после совершения убийства неразрывно слит в романе воедино с анализом философской теории Раскольникова, которая представляется Достоевскому «знаменьем времени», выражением идейных и нравственных шатаний, характерных в его эпоху для значительного числа представителей молодого поколения — прежде всего из городской разночинной, демократической среды.

Раскольников — студент, принужденный из-за отсутствия средств оставить учение. Его мать, вдова провинциального чиновника, живет после смерти мужа на скромный пенсион, бо&#769;льшую часть которого она посылает сыну. Сестра Раскольникова, Дуня, была вынуждена, чтобы помогать матери и брату, поступить гувернанткой в семейство богатых помещиков, где она подвергается обидам и унижению.

Раскольников — одаренный от природы, умный и честный юноша. Живя в тесной каморке, похожей на гроб, на пятом этаже многоэтажного петербургского дома близ Сенной, постоянно наблюдая жизнь бедноты и мещанского населения Петербурга, Раскольников мучительно сознает, что не только он сам, но и тысячи других людей неизбежно обречены при существующем порядке на раннюю смерть, нищету и бесправие, — и это порождает в нем постоянную, глубокую работу мысли, стремящейся найти выход из сложившегося, несправедливого положения вещей.

Но вместе с тем Раскольников и болезненно горд, необщителен, полон сознания своей исключительности. Он не привык к обществу других людей, избегает и чуждается его. Уйдя от всех, «как черепаха в свою скорлупу», герой романа старается самостоятельно решить вопросы, которые рождает в нем сознание несправедливости окружающей социальной жизни, найти ответ на них своими силами.

Раскольников глубоко страдает от голода и нищеты, от унижения матери и сестры, он горячо хотел бы помочь им. Но собственные его лишения и горе близких — не главная причина его мук и его преступления. «Если б только я зарезал из того, что голоден был… — то я бы теперь… счастлив был», — говорит он после исполнения своего страшного замысла. Герой «Преступления и наказания» действует не под влиянием непосредственного, безотчетного порыва, он — человек мысли, человек, привыкший анализировать свои впечатления и поступки.

Размышляя о причинах существующего неравенства и несправедливости, Раскольников приходит к выводу, что всегда существовало различие между двумя разрядами людей. В то время как огромное большинство людей всегда и везде молчаливо и покорно подчинялось установленному порядку вещей, не имея силы восстать против него, в истории человечества время от времени появлялись немногие «необыкновенные» люди — Ликурги, Магометы, Наполеоны, которые и были ее подлинными двигателями. Предназначенные самой природой для роли «властелинов судьбы», они смело восставали против существующего порядка и при этом дерзко нарушали общепризнанные нормы морали, не останавливаясь перед насилием и преступлением для того, чтобы навязать человечеству свою волю. Проклинаемые современниками, подобные «необыкновенные люди» были позднее оправданы потомством, признавшим их героями истории и благодетелями человечества.

Из этой индивидуалистической, анархической по своему общественному содержанию, системы идей, системы, которую он не только обдумал в своем уединении, но и успел изложить в газетной статье за год до совершения убийства, вытекает та дилемма, которую Раскольников формулирует словами: «Вошь ли я, как все, или человек?», «Тварь ли я дрожащая или право имею?»

Герой «Преступления и наказания» — и в этом лежит одна из причин его трагического заблуждения — не задумывается достаточно серьезно о том, почему тысячи и миллионы тружеников в прошлые эпохи и в его время не были способны к историческому творчеству, не могли активно протестовать и бороться против несправедливых условий жизни. Сознание их покорности в прошлом и настоящем вызывает у него гнев и горе, но вместе с тем и побуждает его вознести себя в собственных глазах на неизмеримую высоту, противопоставить себя массам, народу, «обыкновенным», рядовым людям. Раскольников не хочет — как большинство тех людей, которых он наблюдает, — молчаливо повиноваться и терпеть, и эта нравственная непримиримость героя импонирует и автору и читателю романа. Но отсюда, по мнению Раскольникова, возможен лишь один вывод — он должен доказать себе и окружающим, что, подобно другим «необыкновенным» историческим личностям, он не «тварь дрожащая», а прирожденный «властелин судьбы», имеющий право преступать элементарные нравственные законы и нормы, признаваемые нерушимыми обыкновенными, рядовыми людьми. Этот вывод и приводит Раскольникова к его преступлению, которое он рассматривает как испытание, необходимое для того, чтобы определить, принадлежит ли он к породе «необыкновенных» людей или ему остается повиноваться и терпеть, как остальным, обыкновенным слабым натурам.

Своим преступлением Раскольников бросает вызов миру общественного неравенства и подавления человеческой личности. И вместе с тем (хотя герой Достоевского этого не сознает) его «идея» увековечивает бесчеловечность существующего порядка вещей. Неравенство между сильными и слабыми, между хищниками и угнетенными, составляющее основу классового общества и государства, остается для Раскольникова в его размышлениях вечной моделью всякого человеческого общежития. Раскольников рассуждает отвлеченно, по принципу: «так было — так будет», а потому его протест превращается в свою противоположность. Противоречие между немногими, имеющими право любыми средствами — вплоть до насилия и преступления — диктовать другим людям свою волю, и большинством людей, лишенным элементарных человеческих прав и осужденным служить пассивным объектом их действий, возводится героем романа в нерушимый закон жизни, установленный от века и не подлежащий отмене.

Это противоречие между глубоким и искренним протестом Раскольникова против социального угнетения и неравенства — и утверждением самим же героем права одной — сильной — личности строить свою жизнь на крови и костях других — составляет основу трагической коллизии «Преступления и наказания». В ходе развития действия романа Достоевский заставляет героя на личном опыте убедиться, что его бунт против существующей бесчеловечности сам носит бесчеловечный характер, ведет не к подъему и расцвету, а к подавлению и нравственному умерщвлению личности — и герой романа вынужден это постепенно ощутить, сначала одним голосом сердца, которому его ум продолжает сопротивляться, а затем всем своим нравственным существом.

Раскольникову удается совершить задуманное убийство. Но произведенный героем трагический «эксперимент» приводит к иному результату, чем тот, которого он ожидал. На своем опыте и на примере других людей, служащих предметом его наблюдений, — Лужина, Свидригайлова, Сони Мармеладовой, — Раскольников шаг за шагом убеждается в том, что мораль «необыкновенных» людей, которая представлялась ему до совершения преступления горделивым восстанием против существующего порядка вещей, ему не по плечу. И дело не в слабости Раскольникова по сравнению с Магометом и Наполеоном, как ему представлялось вначале (те «смогли», а он не смог!). Из уст несчастной и любимой девушки Раскольников, к своему удивлению, слышит непонятные для него в первый момент, но неотразимые по своей внутренней правде слова о том, что столь импонировавшая ему прежде мораль «необыкновенных людей», спокойно, без угрызений совести строящих свои расчеты на крови других, ничем, в конечном счете, не отличается от бесчеловечной морали, открыто исповедуемой и ежедневно применяемой на практике людьми из господствующих классов, возведшими насилие и преступление в каждодневный, «нормальный» закон жизни. Носителями истинной красоты и нравственности становятся теперь в глазах Раскольникова не те, кто ставит себя выше обыкновенных, рядовых людей, а те, кто, подобно Соне, среди голода и унижений сохраняют в своей душе веру в жизнь и человека, нравственную стойкость и непоколебимость, глубокое отвращение к насилию, злу и преступлению в любых формах.



3


Раскольникову казалось до совершения убийства, что он обдумал вперед и точно расчел все обстоятельства преступления. Но реальная, «живая» жизнь оказывается гораздо сложнее, чем отвлеченные, «книжные» мечты героя. Вместо одной старухи ростовщицы Раскольников оказывается вынужденным убить и ее младшую сестру, кроткую, забитую и бессловесную Лизавету, возвратившуюся неожиданно домой и заставшую его на месте преступления. После убийства Раскольников благодаря случайному стечению обстоятельств попадает в полицию, где навлекает на себя подозрение в совершении убийства. В дальнейшем начинается его долгая и мучительная борьба со следователем Порфирием Петровичем, во время которой Раскольников, желая сбить следователя с толку и, как ему кажется, достигая в этом успеха, на самом деле из-за происходящей в нем внутренней борьбы и беспокойства сам способствует своему разоблачению.

Но Раскольников обманулся, не только полагая, что все обстоятельства преступления могут быть точно взвешены и определены рассудком вперед. Он ошибся еще больше в самом себе, думая, что преступление никак не повлияет на его отношение к внешнему миру и окружающим людям. Раскольников считал, что он нравственно ответствен за свои действия только перед самим собой и что суд других для него безразличен. Однако, как неопровержимо показывает автор «Преступления и наказания», отдельный человек отнюдь не является «одиночкой», каким считали его мыслители-рационалисты в XVIII веке. Человек не только живет в обществе, неразрывно связан каждым актом своей деятельности с другими людьми, но и носит общество в самом себе, в своем сердце, он вплетен всем своим существом в сеть на первый взгляд незаметных, но в действительности неразрывно соединяющих его с окружающими, постоянно действующих связей и отношений. Насильственный разрыв этих связей равнозначен для личности духовному и физическому самоубийству, — поэтому после убийства Раскольников со все время возрастающей силой ощущает тяжелое и мучительное чувство «разомкнутости и разъединенности с человечеством». Самые близкие люди — мать и сестра — оказываются бесконечно далекими, почти чужими ему. Своим преступлением Раскольников, как он постепенно мучительно сознает, поставил себя вне элементарных, но вместе с тем нерушимых законов человеческого общежития. Он думал убить ненавистную ему, отвратительную и бесполезную старуху ростовщицу, сосущую кровь бедняков, — так формулирует свое положение сам герой романа в разговоре с Соней, — а убил «себя». Вот почему после длительной борьбы с собой и ряда попыток нравственного самооправдания, ощущая невыносимость своего положения, Раскольников, по совету Сони и «пристава следственных дел» Порфирия, отдает себя в руки полиции.

В «Пиковой даме» Пушкин первый в русской литературе нарисовал образ молодого человека с «профилем Наполеона» и «душою Мефистофеля», молодого человека, сжигаемого тайным честолюбием и в то же время способного к холодному расчету, которые приводят его к преступлению и к духовному краху. В «Преступлении и наказании» Достоевский непосредственно продолжил эту пушкинскую тему. Не случайно образ Германна Достоевский охарактеризовал как лицо, типичное для целого, «петербургского», периода русской истории.

Но между пушкинским Германном и созданным Достоевским образом Раскольникова есть и существенное различие. Угрожая пистолетом графине, желая вырвать у нее тайну трех карт, Германн стремится одним ударом овладеть «фантастическим богатством», которое позволило бы ему забыть о необходимости «умеренности и трудолюбия», восторжествовать над легкомысленными и счастливыми потомками знатных дворянских родов. Подобно Жюльену Сорелю, герою «Красного и черного» Стендаля, и Растиньяку из романа Бальзака «Отец Горио», Германн руководствуется заботой лишь о своем личном счастье, благополучии своих «внуков и правнуков». Мысль же о несправедливой судьбе других униженных и оскорбленных не тревожит его.

В противоположность Жюльену Сорелю, Растиньяку, пушкинскому Германну, у героя «Преступления и наказания», как уже отмечалось выше, мысль о себе и своем личном неблагополучии еще до совершения убийства неразрывно сплетена с мыслью о страданиях и нищете других людей. В этом состоит глубокое, принципиальное различие между Раскольниковым и плеядой предшествующих ему индивидуалистически настроенных «молодых людей», стоявших в центре внимания других романистов XIX века, — «молодых людей», помыслы которых были ограничены прежде всего личным возвышением и успехом. Раскольников принадлежит к числу тех натур, для которых внешний мир является источником постоянной пытливой мысли, источником наблюдения и беспокойства. Не случайно почти половина страниц «Преступления и наказания» отведена автором описанию одиноких блужданий главного героя по городу, во время которых перед ним широко раскрываются картины безысходно тяжелой жизни столичной бедноты. Отзывчивость Раскольникова к Мармеладову и его семейству, к горю других, окружающих людей, невозможность для него эгоистически замкнуться в самом себе являются, в конечном счете, — хотя сам герой этого не сознает — важнейшими причинами краха его «идеи». Ибо, совершая убийство, Раскольников — как показывает художественный анализ автора «Преступления и наказания» — не только преступает существующий уголовный закон. Гораздо важнее то, что он изменяет тому глубокому нравственному требованию справедливости, которое неизгладимо запечатлено в его собственной душе и в душе других простых людей. Вот почему разум и совесть героя восстают против соблазнявшей его до преступления призрачной идеи «сверхчеловека», заставляют его — после долгой внутренней борьбы — признать свою нравственную вину не перед официальным законом «подлецов», обездоливающих и грабящих народ, но перед тысячами и миллионами страдающих и угнетенных людей, непримиримо осуждающих насилия и преступления своих угнетателей и именно поэтому особенно чутких к голосу совести и к нравственной чистоте.



`;

//const ALPH = 'aäbcdefghijklmnoöpqrsßtuüvwxyz';
const ALPH = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";

const LENGTH = TEXT.length;

let text = TEXT.toLowerCase();

const COLUMS = 10;

const ROWS = Math.ceil(LENGTH / COLUMS);

printHead();

//добавили недостаюшие символы до конца строки
const symbolsToAdd = COLUMS - (LENGTH % COLUMS);
for (let i = 0; i < symbolsToAdd; i++) {
  text += "*";
}

//сформировали массив
let c = 0;
let textArr = [];
for (let i = 0; i < ROWS; i++) {
  textArr[i] = [];
  for (let j = 0; j < COLUMS; j++) {
    textArr[i][j] = text.charAt(c++);
  }
}

document.querySelector(".tableInput").innerHTML += printMatrix(textArr);

//шифрование (обход массива зигзагом)
function encrypt(matrix) {
  let encryptMess = "";

  let even = true,
    odd = false;

  let timeStart = performance.now();
  ///////////////////////     START     ///////////////////////
  for (let i = 0; i < COLUMS; i++) {
    if (even) {
      for (let j = 0; j < ROWS; j++) {
        encryptMess += matrix[j][i];
      }
      even = false;
      odd = true;
      continue;
    }
    if (odd) {
      for (let j = ROWS - 1; j >= 0; j--) {
        encryptMess += matrix[j][i];
      }
      even = true;
      odd = false;
      continue;
    }
  }
  ///////////////////////     FINISH     ///////////////////////
  let timeFinish = performance.now();

  document.querySelector(".encryptTime").innerHTML +=
    timeFinish - timeStart + " мс";
  return encryptMess;
}

let encryptText = encrypt(textArr);
document.querySelector(".encrypt").innerHTML = encryptText;
makeChart("encryptChart", encryptText);

//расшифровка
function decrypt(encryptText) {
  let decryptArr = [];

  for (let i = 0; i < ROWS; i++) {
    decryptArr[i] = [];
  }

  let even = true,
    odd = false,
    encryptIndex = 0;

  let timeStart = performance.now();
  ///////////////////////     START     ///////////////////////
  for (let i = 0; i < COLUMS; i++) {
    if (even) {
      for (let j = 0; j < ROWS; j++) {
        decryptArr[j][i] = encryptText[encryptIndex++];
      }
      if (encryptText != encryptText.length) {
        even = false;
        odd = true;
        continue;
      } else {
        break;
      }
    }
    if (odd) {
      for (let j = ROWS - 1; j >= 0; j--) {
        decryptArr[j][i] = encryptText[encryptIndex++];
      }
      if (encryptText != encryptText.length) {
        even = true;
        odd = false;
        continue;
      } else {
        break;
      }
    }
  }

  ///////////////////////     FINISH     ///////////////////////
  let timeFinish = performance.now();

  return decryptArr;
}

let decryptText = decrypt(encryptText).flat().join("");
document.querySelector(".decrypt").innerHTML = decryptText;
makeChart("decryptChart", decryptText);

function printMatrix(matrix) {
  let result = "";
  for (let i = 0; i < matrix.length; i++) {
    result += `<tr>`;
    for (let j = 0; j < matrix[i].length; j++) {
      result += `<td>${matrix[i][j]}</td>`;
    }
    result += `</tr>`;
  }
  return result;
}

function printHead() {
  let result = "";
  for (let i = 0; i < COLUMS; i++) {
    result += `<th>${i}</th>`;
  }
  document.querySelector(".tableHeadInput").innerHTML = result;
}

function makeChart(id, text) {
  const alphArr = ALPH.split("");
  const data = Frequency(text, alphArr);

  new Chart(document.getElementById(id), {
    type: "bar",
    data: {
      labels: Object.keys(data),
      datasets: [
        {
          data: Object.values(data),
        },
      ],
    },
    options: {
      legend: {
        display: false,
      },
      title: {
        display: true,
        text: id,
      },
    },
  });
}

function Frequency(str, alph) {
  let letters = {};

  alph.forEach((letter) => {
    letters[letter] =
      str.split(letter).length > 0
        ? ((str.split(letter).length - 1) / str.length).toFixed(4)
        : 0;
  });

  console.log(letters);
  return letters;
}
